"""
প্রতিটি ডাউনলোডের জন্য একাধিক রিকোয়েস্ট তৈরি করা
মনে করা যাক, প্রতিটি দেশের পতাকাকে শুধুমাত্র কান্ট্রি কোড দিয়ে সেভ করার বদলে দেশের নাম এবং কান্ট্রি কোড উভয়টি দিয়ে সেভ করার প্রয়োজন। এক্ষেত্রে প্রতিটি পতাকার জন্য দুটি HTTP রিকোয়েস্ট পাঠাতে হবে: প্রথমটি পতাকার ইমেজটি নিয়ে আসার জন্য, এবং দ্বিতীয়টি ইমেজের একই ডিরেক্টরিতে থাকা metadata.json ফাইলটি নিয়ে আসার জন্য—কারণ এই ফাইলেই দেশের নামটি লেখা থাকে।

থ্রেডেড স্ক্রিপ্টে (threaded script) একই টাস্কের ভেতরে একাধিক রিকোয়েস্ট পরিচালনা করা বেশ সহজ। এক্ষেত্রে প্রথমে একটি রিকোয়েস্ট এবং তারপর অন্যটি পাঠাতে হয়, যার ফলে থ্রেডটি দুবার ব্লক হয়। এরপর উভয় ডেটা (কান্ট্রি কোড এবং দেশের নাম) লোকাল ভেরিয়েবলে (local variables) সংরক্ষণ করতে হয়, যেন ফাইলগুলো সেভ করার সময় সহজেই ব্যবহার করা যায়।

অ্যাসিনক্রোনাস স্ক্রিপ্টে কলব্যাক (callbacks) ব্যবহার করে একই কাজ করতে চাইলে, nested functions ব্যবহার করার প্রয়োজন হবে। কারণ, ফাইল সেভ করার পূর্ব পর্যন্ত কান্ট্রি কোড এবং দেশের নাম যেন তাদের ক্লোজারে (closures) সংরক্ষিত থাকে তা নিশ্চিত করতে হয়। এর কারণ হলো, প্রতিটি কলব্যাক একটি ভিন্ন লোকাল স্কোপে (local scope) রান করে বা কাজ করে। await কিওয়ার্ডটি এই ঝামেলা থেকে মুক্তি দেয়। এটি ব্যবহার করে অ্যাসিনক্রোনাস রিকোয়েস্টগুলোকে একটার পর একটা পরিচালনা করা যায় এবং মূল বা ড্রাইভিং কোরুটিনের (coroutine) লোকাল স্কোপ সহজেই শেয়ার করা সম্ভব হয়।

asyncio ফ্ল্যাগ ডাউনলোডিং স্ক্রিপ্টের তৃতীয় সংস্করণে কিছু পরিবর্তন রয়েছে:

get_country
এই নতুন কোরুটিন নির্দিষ্ট কান্ট্রি কোডের জন্য metadata.json ফাইলটি নিয়ে আসে এবং সেখান থেকে দেশের নামটি বের করে নেয়।

download_one
এই কোরুটিন এখন await ব্যবহার করে get_flag এবং নতুন get_country কোরুটিনের কাছে কাজ হস্তান্তর করে। এরপর দ্বিতীয়টির (get_country) ফলাফল ব্যবহার করে সেভ করার জন্য ফাইলের নাম তৈরি করে।

এখন get_country-এর কোড (Example 21-8) দিয়ে শুরু করা যাক। লক্ষণীয় যে, এটি Example 21-6 এর get_flag-এর সাথে অনেকটাই মিলে যায়।

Example 21-8. flags3_asyncio.py: get_country coroutine
"""
async def get_country(client: httpx.AsyncClient, base_url: str, cc: str) -> str:
    url = f'{base_url}/{cc}/metadata.json'.lower()
    resp = await client.get(url, timeout=3.1, follow_redirects=True)
    resp.raise_for_status()
    metadata = resp.json()

    return metadata['country']
"""
১. সবকিছু ঠিক থাকলে এই কোরুটিন দেশের নামসহ একটি স্ট্রিং (string) রিটার্ন করে।
২. রিকোয়েস্টের রেসপন্স থেকে পাওয়া JSON কন্টেন্ট থেকে তৈরি একটি Python ডিকশনারি (dict) metadata ভেরিয়েবলে জমা হবে।
৩. দেশের নামটি রিটার্ন করবে।

এবার Example 21-9-এ পরিবর্তিত download_one কোরুটিনটি দেখা যাক, যেখানে Example 21-6-এর একই কোরুটিন থেকে শুধুমাত্র কয়েকটি লাইন পরিবর্তন করা হয়েছে।

Example 21-9. flags3_asyncio.py: download_one coroutine
"""
async def download_one(client: httpx.AsyncClient, cc: str, base_url: str, semaphore: asyncio.Semaphore, verbose: bool) -> DownloadStatus:
    try:
        async with semaphore:
            image = await get_flag(client, base_url, cc)
        async with semaphore:
            country = await get_country(client, base_url, cc)
    except httpx.HTTPStatusError as exc:
        res = exc.response
        if res.status_code == HTTPStatus.NOT_FOUND:
            status = DownloadStatus.NOT_FOUND
            msg = f'not found: {res.url}'
        else:
            raise
    else:
        filename = country.replace(' ', '_')
        await asyncio.to_thread(save_flag, image, f'{filename}.gif')
        status = DownloadStatus.OK
        msg = 'OK'
    
    if verbose and msg:
        print(cc, msg)
    
    return status

"""
১. get_flag-এর জন্য await করতে সেমাফোর (semaphore) ধরে রাখতে হবে…
২. …এবং get_country-এর জন্যও পুনরায় একই কাজ করতে হবে।
৩. ফাইলের নাম তৈরি করতে দেশের নামটি ব্যবহার করা হয়েছে। command-line ব্যবহারকারী হিসেবে ফাইলের নামে স্পেস (spaces) থাকা সাধারণত পছন্দনীয় নয়।

এটি নেস্টেড কলব্যাকের চেয়ে অনেক বেশি কার্যকরী এবং গোছানো!

get_flag এবং get_country-এর কলগুলোকে সেমাফোর দ্বারা নিয়ন্ত্রিত আলাদা আলাদা with ব্লকে রাখা হয়েছে। কারণ, সেমাফোর এবং লকগুলোকে (locks) যতটা সম্ভব কম সময়ের জন্য ধরে রাখা একটি ভালো প্রোগ্রামিং প্র্যাকটিস।

asyncio.gather ব্যবহার করে get_flag এবং get_country উভয়কেই সমান্তরালভাবে বা প্যারালালে (in parallel) শিডিউল করা যেত। কিন্তু যদি get_flag কোনো এক্সেপশন রেইজ করে, তবে সেভ করার মতো কোনো ইমেজই থাকবে না; তাই তখন get_country রান করা একেবারেই অর্থহীন। তবে এমন কিছু ক্ষেত্র রয়েছে যেখানে পরবর্তী রিকোয়েস্ট করার আগে একটি রেসপন্সের জন্য অপেক্ষা না করে, একই সাথে একাধিক API-তে হিট করার জন্য asyncio.gather ব্যবহার করাটা যৌক্তিক।

flags3_asyncio.py স্ক্রিপ্টটিতে await সিনট্যাক্সটি ছয়বার এবং async with তিনবার ব্যবহার করা হয়েছে। আশা করা যায়, Python-এ অ্যাসিনক্রোনাস প্রোগ্রামিংয়ের ধারণাটি ধীরে ধীরে আরও পরিষ্কার হয়ে উঠছে।

একটি বড় চ্যালেঞ্জ হলো ঠিক কখন await ব্যবহার করতে হবে এবং কখন করা যাবে না তা বুঝতে পারা। তাত্ত্বিকভাবে এর উত্তরটি বেশ সহজ: শুধুমাত্র কোরুটিন এবং অন্যান্য awaitable অবজেক্ট (যেমন asyncio.Task ইনস্ট্যান্স)-এর জন্য await ব্যবহার করতে হয়। তবে কিছু API বেশ জটিল হয়, যেখানে কোরুটিন এবং সাধারণ ফাংশনগুলোকে এমনভাবে মিশ্রিত করা হয় যা বোঝা কঠিন। এর একটি উদাহরণ হলো StreamWriter ক্লাস, যা Example 21-14-এ ব্যবহার করা হবে।

Example 21-9 এর মাধ্যমে ফ্ল্যাগ সম্পর্কিত উদাহরণগুলো শেষ হলো। এখন অ্যাসিনক্রোনাস প্রোগ্রামিংয়ে থ্রেড বা প্রসেস এক্সিকিউটরের ব্যবহার নিয়ে আলোচনা করা যাক।
"""
